---
title: FilterNumericRuleEvaluator
classe: Autodesk.Revit.DB.FilterNumericRuleEvaluator
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# FilterNumericRuleEvaluator

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `filterNumericRuleEvaluator.IsValidObject` | Boolean |
| `Void Dispose()` | `filterNumericRuleEvaluator.Dispose()` | Void |
| `Boolean Evaluate(Int64, Int64)` | `filterNumericRuleEvaluator.Evaluate(lhs, rhs)` | Boolean |
| `Boolean Evaluate(Int32, Int32)` | `filterNumericRuleEvaluator.Evaluate(lhs, rhs)` | Boolean |
| `Boolean Evaluate(Double, Double, Double)` | `filterNumericRuleEvaluator.Evaluate(lhs, rhs, epsilon)` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```